//模拟新闻数据
const news = [
   {
    id: "c550a117197",
    title: "中国海大志愿者完成第五届跨国公司领导人青岛峰会志愿服务",
    poster:
      "https://news.ouc.edu.cn/_upload/article/images/dd/19/ede76a4a4ebdb1d3ab278a12fdd8/9bb154f8-e33b-421a-b453-82c758a32405_s.jpg",
    content:
      "本站讯 8 月 27 日至 29 日，第五届跨国公司领导人青岛峰会在青岛国际会议中心举办。为全面做好服务保障，确保峰会顺利举行，中国海洋大学招募选派 115 名志愿者参与峰会志愿服务，志愿者们以饱满的热情完成本次大会的各项工作，累计服务时长 3000 余小时，用实际行动展现中国海大青年风采。前期，学校团委根据峰会安排及各工作组志愿者需求，面向崂山校区 15 个学部、学院（中心）进行志愿者选拔招募，并邀请青岛团市委、峰会组委会相关专家对志愿者开展了峰会情况介绍、志愿服务礼仪与规范、大型赛会志愿服务知识与技能等系统培训。峰会举办期间，学校志愿者在 4 个工作组分别参与会务服务、媒体接待、酒店接待、交通抵离、青企峰会、人力资源高质量发展对话会等 15 个组别的工作任务。中国海大青年志愿者用耐心热心的服务态度、吃苦耐劳的坚韧品质、蓬勃向上的服务热情赢得广泛赞誉。恰逢学校百年华诞，此次峰会的志愿服务为志愿者和学校志愿服务工作提供了宝贵经验，也为学校建校 100 周年系列庆祝活动志愿服务夯基蓄力。学校团委将继续以服务大型赛会为依托，完善志愿服务工作体系，引领学生在志愿服务中成长成才，挺膺担当。通讯员：周星宇 张卓越 图：段玉军 中国海大青年志愿者",
    add_date: "2024-08-31",
  },
  {
    id: "c550a117188",
    title: "贵州省人大干部综合能力提升培训班在中国海洋大学举办",
    poster:
      "https://news.ouc.edu.cn/_upload/article/images/3a/4d/73b22a9b404f93e907238f2a2325/55606b28-53b8-412f-9420-74c7a30657b6_s.jpg",
    content:
      "本站讯 8 月 26 日至 30 日，贵州省人大干部综合能力提升培训班（第三期）在中国海洋大学举办。贵州省人大常委会党组成员于杰，中国海洋大学党委常委、副校长王雪鹏出席开班式，贵州省人大常委会副秘书长、机关党组成员闵红棕主持开班式。王雪鹏在致辞中代表学校对参加本次培训的各位领导和学员表示欢迎，向专题培训班的顺利开班表示祝贺，他介绍了学校的办学历史和基本情况、学校在干部培训方面的有关做法和工作成效，表示学校将积极发挥教育资源和学科特色优势，围绕培训需求，聚焦培训主题做好有关工作，为高质量实现培训的既定目标和任务提供保障。于杰在讲话中指出，此次培训借助中国海洋大学悠久的办学历史、深厚的文化积淀、优质的培训资源，为参训学员提供了良好的学习平台和环境，希望参训学员以此次培训为契机，牢牢把握新时代人大文稿和宣传工作的基本要求，进一步增强服务保障常委会依法履职的能力和水平。闵红棕介绍了培训班的基本情况，强调了参训有关要求。本次培训班围绕“深入学习贯彻习近平新时代中国特色社会主义思想和习近平总书记视察贵州重要讲话精神，全面提升人大机关综合服务保障能力水平”主题，开设了习近平新时代中国特色社会主义思想、人民代表大会制度的理论与实践、新媒体与舆情应对、我国周边安全环境和国际热点问题等专题讲座，组织学员围绕有关主题开展了现场教学。贵州省、市、县人大系统从事文稿写作和新闻宣传的 50 余名干部参加培训。通讯员：宋济汉 甄馨 图：栾清竹",
    add_date: "2024-08-30",
  },
  {
    id: "c550a117172",
    title: "中国海洋大学开展 2024 级本科生集中入学教育",
    poster:
      "https://gaopursuit.oss-cn-beijing.aliyuncs.com/2022/newsimage3.jpg",
    content:
      "本站讯 为帮助 2024 级本科生尽快适应大学生活，8 月 27 日，学校在崂山校区体育馆举行了 2024 级本科生集中入学教育。当天的集中教育分为心理健康教育、传染病防控教育和安全教育三个部分。学校学生工作处副处长、心理健康教育与咨询中心主任牟宏玮就“如何解决大学生的心理困惑”这一问题与同学们深入交流，引导同学们用“热爱心、平常心、进取心、同理心、初心”五心来调整自身状态，积极适应大学生活；青岛市中心医院呼吸科副主任刘加洪医生主讲《肺结核、新冠、流感等呼吸道传染病防治及校园控烟》，带领同学们认识了肺结核等呼吸道传染病的感染症状、传染途径和预防措施，以及吸烟的危害和校园控烟措施；学校党委保卫部副部长、保卫处副处长王法利以《平安海大 与你同行》为题，为 2024 级本科生讲授入学安全教育第一课。他用生动的案例和详实的数据，向同学们介绍了防盗、防诈骗、消防安全、交通安全、网络安全、国家安全等安全知识，教育引导同学们遵守国家法律法规和学校规章制度，主动学习安全知识，提高安全防范技能。新生入学教育是大学生思想政治教育的重要内容。近年来，学校采取入学适应与系统教育相结合、线上教育与线下教育相结合、学校统筹谋划推进与院系特色教育相结合的教育模式，将入学教育向前延伸至寄送录取通知书和入学须知，向后贯穿整个秋季学期，内容涵盖校规校纪、爱校荣校、学业指导、团体适应等主题教育，旨在帮助新生科学制定发展规划，度过充实美好的大学生活，学有所获、学有所长。学校党委办公室、校长办公室、党委宣传部、党委学生工作部、学生工作处、武装部、学生就业创业指导与服务中心、团委、教务处、研究生院、保卫处、国有资产与实验室管理处、后勤保障处、校史馆、图书馆、网络与信息中心、学部、各学院（中心）参与新生入学教育工作。通讯员：孙文景 图：容致远",
    add_date: "2024-08-29",
  },
];

//获取新闻列表
function getNewsList() {
  let list = [];
  for (var i = 0; i < news.length; i++) {
    let obj = {};
    obj.id = news[i].id;
    obj.poster = news[i].poster;
    obj.add_date = news[i].add_date;
    obj.title = news[i].title;
    list.push(obj);
  }
  return list; //返回新闻列表
}

//获取新闻内容
function getNewsDetail(newsID) {
  let msg = {
    code: '404', //没有对应的新闻
    news: {}
  };
  for (var i = 0; i < news.length; i++) {
    if (newsID == news[i].id) { //匹配新闻id编号
      msg.code = '200'; //成功
      msg.news = news[i]; //更新当前新闻内容
      break;
    }
  }
  return msg; //返回查找结果
}

// 对外暴露接口
module.exports = {
  getNewsList: getNewsList,
  getNewsDetail: getNewsDetail
}